Revit 2027 API
Metal.MetalColor Property
 The property labeled "Color" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalColor { get; }
Public Shared ReadOnly Property MetalColor As String
	Get
public:
static property String^ MetalColor {
	String^ get ();
}
static member MetalColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace